<template>
  <nav class="navbar navbar-expand-lg">
    <div class="container-fluid mx-3"> <!-- Горизонтальные отступы -->
      <a class="navbar-brand" href="#">
        <svg width="80" height="50" viewBox="0 0 30 19" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path
            d="M20.6537 12.8489C20.9788 13.0087 21.0535 13.6858 21.0535 14.4966C21.0535 15.3285 20.9732 16.0157 20.6281 16.154C20.1253 16.3071 19.7686 16.6781 19.7686 17.1134C19.7686 17.1608 19.7785 17.2042 19.7869 17.2491C16.7721 15.0186 17.0041 11.435 17.0041 11.435C17.0041 11.435 18.2294 11.0223 20.4321 11C20.0367 11.1826 19.7683 11.5076 19.7683 11.8828C19.7683 12.3244 20.1368 12.7012 20.6537 12.8489ZM24.1069 11.3032C23.3914 11.1826 22.6663 11.0971 21.9361 11.0475C22.279 11.2356 22.504 11.5375 22.504 11.8828C22.504 12.3244 22.1354 12.7012 21.6201 12.8489C21.2937 13.0087 21.2192 13.6858 21.2192 14.4966C21.2192 15.3285 21.2993 16.0157 21.6444 16.154C21.6501 16.1558 21.6567 16.1584 21.6622 16.1599L21.6423 16.1437C22.0119 16.2712 22.7878 15.7755 23.6584 15.1178C24.5266 14.4625 25.1837 13.8766 25.0178 13.5973L25.031 13.6075C24.9686 13.4874 24.9361 13.3596 24.9354 13.2306C24.9354 12.6587 25.5476 12.1959 26.3048 12.1959C26.4495 12.1959 26.5862 12.2182 26.7189 12.2493C26.0108 11.8168 25.1533 11.479 24.1069 11.3032ZM27.588 12.8879C27.6382 12.9947 27.6704 13.1087 27.6704 13.2307C27.6704 13.6798 27.291 14.0609 26.7598 14.2025C26.457 14.3667 26.3869 14.9558 26.3869 15.6586C26.3869 16.3648 26.4582 16.9552 26.7632 17.1176C27.292 17.2602 27.6704 17.642 27.6704 18.0896C27.6704 18.4861 27.3733 18.8256 26.9402 19C28.6969 18.9493 29.9994 18.6906 29.9994 18.6906C29.9994 18.6906 30.1029 15.1085 27.588 12.8879ZM25.7334 14.1682C25.3438 14.1042 24.6035 14.5824 23.7762 15.206C22.9058 15.8647 22.25 16.4513 22.4182 16.7298L22.3992 16.7159C22.4688 16.8418 22.5044 16.977 22.504 17.1134C22.504 17.6312 21.9996 18.0562 21.3428 18.132C21.5932 18.238 21.8549 18.339 22.1344 18.4289C23.2799 18.7965 24.5122 18.9509 25.6535 18.9942C25.228 18.818 24.9353 18.4815 24.9353 18.0896C24.9353 17.642 25.3149 17.2603 25.8448 17.1176C26.1488 16.9552 26.22 16.3648 26.22 15.6586C26.22 14.9558 26.1498 14.3666 25.8469 14.2025C25.8084 14.1925 25.7705 14.181 25.7334 14.1682Z"
            fill="white" />
          <g clip-path="url(#clip0_1_16)">
            <path
              d="M0.305032 5.15576C-0.407831 2.36592 1.59564 0.839337 3.81398 0.652975C5.66913 0.497184 7.54038 1.31173 8.77114 2.44816C5.80884 1.58583 2.12125 2.80858 0.305032 5.15576ZM12.695 5.8449C13.4078 8.63474 11.4045 10.1611 9.18624 10.347C7.3311 10.5037 5.45962 9.68865 4.22897 8.55221C7.19127 9.41474 10.8789 8.19198 12.695 5.8449Z"
              fill="white" />
            <path
              d="M6.09306 10.742C2.79597 11.3452 0.991942 9.64984 0.771584 7.77297C0.587468 6.20333 1.55011 4.61987 2.89317 3.57845C1.87405 6.08492 3.31924 9.20519 6.09306 10.742ZM6.90749 0.258199C10.2047 -0.344899 12.0086 1.35034 12.2285 3.22731C12.4135 4.79686 11.4503 6.38051 10.1073 7.42183C11.1264 4.91526 9.68132 1.7949 6.90749 0.258199Z"
              fill="white" />
          </g>
          <line y1="-0.1" x2="24.6674" y2="-0.1" transform="matrix(0.856308 -0.516465 0.69129 0.722577 5 16.7398)"
            stroke="white" stroke-width="0.2" />
          <defs>
            <clipPath id="clip0_1_16">
              <rect width="13" height="11" fill="white" />
            </clipPath>
          </defs>
        </svg>

      </a>
      <!-- <a href=""> -->

      <!-- </a> -->
      <button class="navbar-toggler" type="button" data-bs-toggle="collapse" data-bs-target="#navbarSupportedContent"
        aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
        <span class="navbar-toggler-icon"></span>
      </button>
      <div class="collapse navbar-collapse" id="navbarSupportedContent">
        <ul class="navbar-nav me-auto mb-2 mb-lg-0">

          <li class="nav-item dws">
            <router-link to="/about-company" class="nav-link">О компании</router-link>
          </li>
          <li class="nav-item dws">
            <router-link to="/products" class="nav-link">Продукция</router-link>
          </li>
          <li class="nav-item dws">
            <router-link to="/workspace" class="nav-link">Рабочая среда</router-link>
          </li>

          <li class="nav-item dws">
            <router-link to="/login" class="nav-link" @click="deleteTokenUser">Выход</router-link>
          </li>
        </ul>

        <!-- <form class="d-flex"> -->

        <router-link to="/login" class="nav-link">
          <div class="icon_block"></div>
        </router-link>
        <!-- </form> -->
      </div>
    </div>
  </nav>
</template>

<style  scoped>
@import './style/style-navbar.scss';
</style>


<script>
export default {
  setup() {
    const deleteTokenUser = () => {
      localStorage.removeItem('accessToken')
    }
    return {
      deleteTokenUser
    }
  }
}
</script>