<template>

  <nav class="navbar">
    <!-- <img src="./assets/logo_company.png" alt=""> -->
    <div class="container_block">
      <div class="row_1">
        <p class="blue_text"><i class="bi bi-dot" style="color: #9FD1D4 !important;"></i> Корпоративный портал</p>
      </div>
      <div class="row_2">
        <div class="logo_block">
          <!-- Фармтек -->
          <svg class="dynamic-svg-farmtec" viewBox="0 0 182 58" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd"
              d="M11.9221 16.6046C20.2345 11.7862 29.515 10.8799 36.9053 13.4371C36.6224 13.1227 36.3193 12.8065 36.0143 12.4922C26.5097 2.99331 12.5853 1.50239 4.9103 9.18311C0.378433 13.722 -0.968085 20.4468 0.670516 27.1495C3.32865 23.0518 7.14042 19.375 11.9221 16.6046Z"
              fill="white" />
            <path fill-rule="evenodd" clip-rule="evenodd"
              d="M14.7658 45.3292C9.94921 37.0124 9.04357 27.7176 11.597 20.3145C11.2792 20.6105 10.9706 20.9138 10.662 21.219C1.15367 30.7289 -0.325113 44.6582 7.35537 52.3445C11.8946 56.8797 18.6125 58.2273 25.3028 56.5911C21.2082 53.9365 17.5231 50.1017 14.7658 45.3292Z"
              fill="white" />
            <path fill-rule="evenodd" clip-rule="evenodd"
              d="M39.5854 12.1723C44.402 20.491 45.3003 29.7858 42.7542 37.1834C43.0665 36.8929 43.3769 36.5878 43.6929 36.2844C53.1938 26.7709 54.68 12.8415 46.9995 5.15894C42.4603 0.618164 35.746 -0.723848 29.0447 0.910466C33.1375 3.57427 36.8262 7.39441 39.5854 12.1723Z"
              fill="white" />
            <path fill-rule="evenodd" clip-rule="evenodd"
              d="M42.4346 41.182C34.113 45.9985 24.8306 46.9048 17.4514 44.3403C17.7398 44.6583 18.0448 44.9837 18.3534 45.2871C27.8507 54.8007 41.7843 56.2861 49.4482 48.5961C53.9838 44.0646 55.3156 37.3416 53.6954 30.6371C51.0188 34.733 47.2108 38.4189 42.4346 41.182Z"
              fill="white" />
            <path fill-rule="evenodd" clip-rule="evenodd"
              d="M75.8366 20.4615V22.026H78.5444C81.4744 22.026 83.1993 22.379 84.4044 24.1034C85.5176 25.7175 85.6903 27.7801 85.6903 29.8023C85.6903 31.7822 85.5562 33.9148 84.5881 35.5013C83.44 37.3617 81.5846 37.7772 79.2277 37.7772H75.8366V39.6339H72.2288V37.7772H68.834C66.4845 37.7772 64.6254 37.3617 63.4773 35.5013C62.5129 33.9148 62.3751 31.7822 62.3751 29.8023C62.3751 27.7801 62.5423 25.7248 63.661 24.1034C64.8643 22.379 66.5874 22.026 69.4972 22.026H72.2251V20.4615H75.8366ZM72.2288 24.8902H70.0905C68.8046 24.8902 67.2964 25.0887 66.6002 26.4822C66.4165 26.8738 66.1097 27.6606 66.1097 29.7913C66.1097 31.922 66.3632 32.7327 66.5176 33.1004C67.2799 34.8211 69.1941 34.8817 70.6196 34.8817H72.238V24.8902H72.2288ZM77.4458 34.8891C78.8695 34.8891 80.7892 34.8284 81.557 33.1077C81.8014 32.5562 81.963 31.7142 81.963 29.7986C81.963 28.1037 81.8014 27.1716 81.4468 26.4896C80.7341 25.0961 79.3435 24.8975 77.9749 24.8975H75.8366V34.8964L77.4458 34.8891Z"
              fill="white" />
            <path fill-rule="evenodd" clip-rule="evenodd"
              d="M96.7876 25.1146C98.0221 25.1146 99.1427 25.554 99.8021 26.2415C100.401 26.8776 100.864 28.0487 100.864 29.6628V37.1854C100.864 37.7038 100.816 38.5292 100.287 39.0495C99.7581 39.5697 98.9773 39.6267 98.2958 39.6267H91.3758C90.5823 39.6267 89.5737 39.6267 88.7489 38.9171C87.5714 37.9042 87.4943 36.0456 87.4943 34.9757C87.4943 33.6888 87.6265 32.4019 88.7232 31.4386C89.627 30.65 90.6043 30.593 91.3758 30.593H97.6694V29.5782C97.701 29.0864 97.552 28.6001 97.2506 28.2104C96.8189 27.6589 96.1888 27.5854 95.6946 27.5854H88.5597V25.1146H96.7876ZM92.3329 33.0564C92.1143 33.0564 91.5099 33.084 91.1536 33.5472C91.0507 33.6851 90.799 34.0675 90.799 35.108C90.799 35.5492 90.856 36.3158 91.2344 36.7221C91.5157 36.9916 91.8867 37.1474 92.276 37.1596H96.7325C96.9826 37.182 97.2333 37.1247 97.4489 36.996C97.5333 36.9237 97.5979 36.8311 97.6365 36.7269C97.675 36.6226 97.6864 36.5102 97.6694 36.4004V33.0564H92.3329Z"
              fill="white" />
            <path fill-rule="evenodd" clip-rule="evenodd"
              d="M106.259 44.285H103.055V27.372C103.042 27.0322 103.108 26.6941 103.25 26.3849C103.391 26.0757 103.603 25.8042 103.869 25.5924C104.42 25.1788 105.135 25.1218 105.684 25.1218H110.74C111.658 25.1218 113.615 25.2542 115.007 26.7157C116.488 28.2452 116.541 30.4844 116.541 32.0801C116.541 33.9883 116.431 36.0749 115.395 37.5547C114.024 39.5236 111.785 39.6339 110.304 39.6339H106.263V44.285H106.259ZM109.893 37.1595C111.48 37.1595 112.281 36.4002 112.628 35.8248C112.935 35.391 113.234 34.5049 113.234 32.3319C113.234 30.3667 113.014 29.5946 112.852 29.2159C112.437 28.2783 111.48 27.576 110.058 27.576H106.913C106.753 27.5973 106.6 27.6608 106.472 27.7599C106.404 27.822 106.349 27.8978 106.312 27.9824C106.275 28.0669 106.257 28.1584 106.257 28.2507V37.1466L109.893 37.1595Z"
              fill="white" />
            <path fill-rule="evenodd" clip-rule="evenodd"
              d="M129.236 38.5861C129.012 39.1615 128.52 39.7884 127.368 39.7884C126.216 39.7884 125.733 39.1615 125.515 38.5861L121.793 29.1681C121.765 29.0891 121.686 28.8721 121.571 28.8721C121.407 28.8721 121.407 29.0376 121.407 29.1111L121.545 39.6266H118.347V27.0356C118.347 25.6127 119.519 24.9509 120.838 24.9509C122.035 24.9509 122.84 25.3369 123.301 26.5153L126.964 35.7366C127.015 35.8708 127.236 36.3102 127.368 36.3102C127.5 36.3102 127.736 35.8708 127.787 35.7366L131.448 26.5098C131.911 25.3314 132.706 24.9454 133.912 24.9454C135.221 24.9454 136.403 25.6072 136.403 27.0301V39.6211H133.199L133.335 29.1056C133.335 28.9402 133.23 28.8354 133.171 28.8354C133.085 28.8354 132.988 29.056 132.931 29.1626L129.236 38.5861Z"
              fill="white" />
            <path fill-rule="evenodd" clip-rule="evenodd"
              d="M142.94 39.6267V27.5836H137.496V25.1146H151.582V27.5836H146.137V39.6267H142.94Z" fill="white" />
            <path fill-rule="evenodd" clip-rule="evenodd"
              d="M157.759 39.6266C156.29 39.6266 154.532 39.4887 153.33 37.7882C152.377 36.4242 152.294 34.4203 152.294 32.5029C152.294 29.7895 152.428 27.793 154.012 26.4271C155.595 25.0612 158.068 25.0557 159.433 25.0557C161.128 25.0557 162.875 25.1384 164.222 25.9914C165.916 27.0558 166.272 28.8666 166.272 30.6976C166.272 31.433 166.191 32.2878 165.587 32.9037C165.153 33.3283 164.602 33.446 164.025 33.446H155.608C155.604 34.1153 155.666 34.7834 155.792 35.4406C156.198 36.9977 157.543 37.1613 158.716 37.1613H165.807V39.6284L157.759 39.6266ZM162.247 30.9863C162.875 30.9863 162.964 30.523 162.964 30.1314C162.966 29.7588 162.883 29.3906 162.722 29.0546C162.561 28.7186 162.326 28.4236 162.034 28.1919C161.228 27.5926 160.197 27.5375 159.291 27.5375C158.45 27.5375 157.137 27.5044 156.257 28.4897C155.608 29.2251 155.638 30.0193 155.608 30.9863H162.247Z"
              fill="white" />
            <path fill-rule="evenodd" clip-rule="evenodd"
              d="M168.074 39.6267V25.1146H171.28V39.6267H168.074ZM178.007 39.6267L172.733 33.8469C172.398 33.4976 171.904 32.902 171.904 32.1501C171.904 31.3982 172.509 30.729 172.918 30.2639L177.536 25.1165H181.343L175.845 30.9809C175.602 31.2272 175.159 31.6886 175.159 32.1519C175.159 32.4552 175.459 32.9516 175.681 33.1704L181.863 39.6267H178.007Z"
              fill="white" />
          </svg>
          <!-- Линия -->
          <svg class="dynamic-svg-line" viewBox="0 0 2 65" fill="none" xmlns="http://www.w3.org/2000/svg">


            <path d="M1 0V65" stroke="white" />


          </svg>
          <!-- Интелбио -->
          <svg class="dynamic-svg-intelbio" viewBox="0 0 196 41" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path
              d="M57.8133 15.2636C57.8133 15.2636 61.5111 16.2556 61.5111 20.0012V30.9865C61.5111 32.186 61.3109 34.1351 61.3109 34.1351H61.3678C61.3678 34.1351 62.3359 32.1566 63.0836 30.9552L70.7567 19.2407H74.4307V39.5763H70.7567V27.8599C70.7567 26.6585 70.9606 24.7094 70.9606 24.7094H70.9074C70.9074 24.7094 69.9576 26.6585 69.2155 27.8599L61.4817 39.5744H57.8077L57.8133 15.2636Z"
              fill="white" />
            <path
              d="M77.9707 24.9667H81.6116V30.6099H87.8574V24.9667H91.4928V39.5745H87.8556V33.6777H81.6098V39.5745H77.9707V24.9667Z"
              fill="white" />
            <path d="M98.0748 28.0583H93.2637V24.9667H106.525V28.0583H101.681V39.5726H98.0748V28.0583Z" fill="white" />
            <path
              d="M114.455 24.6249C118.638 24.6249 120.929 27.6891 120.929 31.5559C120.919 32.0261 120.882 32.4952 120.819 32.9612H110.77C110.998 35.511 112.947 36.8189 115.15 36.8189C116.643 36.8189 118.161 36.1613 119.336 35.2189L120.767 37.8238C119.279 39.1427 116.983 39.9161 114.889 39.9161C110.047 39.9161 107.012 36.4258 107.012 32.265C107.008 27.7754 110.072 24.6249 114.455 24.6249ZM117.292 30.4684C117.266 28.5194 116.006 27.3731 114.371 27.3731C112.508 27.3731 111.191 28.6057 110.847 30.4684H117.292Z"
              fill="white" />
            <path
              d="M121.869 36.5084C123.675 36.2494 124.937 34.7321 124.937 29.5499V24.9574H135.592V39.5652H131.954V27.9186H128.405V29.5536C128.405 35.9096 126.712 39.5744 121.871 39.7177L121.869 36.5084Z"
              fill="white" />
            <path
              d="M139.881 19.5236H150.817V20.6736H141.11V28.1189H146.27C149.478 28.1189 152.055 29.9229 152.055 33.8779C152.055 37.3976 149.678 39.5726 146.469 39.5726H139.881V19.5236ZM146.355 38.4337C149.046 38.4337 150.764 36.7675 150.764 33.8779C150.764 30.9883 148.905 29.2615 146.327 29.2615H141.11V38.4337H146.355Z"
              fill="white" />
            <path
              d="M156.317 19.5236H157.549V35.2501C157.549 36.2531 157.408 37.7742 157.408 37.7742H157.465C157.465 37.7742 158.551 36.0805 159.212 35.1638L170.524 19.5236H171.674V39.5744H170.44V23.8479C170.44 22.8486 170.583 21.3294 170.583 21.3294H170.524C170.524 21.3294 169.523 22.9331 168.871 23.8479L157.481 39.5744H156.333L156.317 19.5236Z"
              fill="white" />
            <path
              d="M184.952 19.182C190.536 19.182 195.088 23.6495 195.088 29.4104C195.088 35.309 190.536 39.9217 184.952 39.9217C179.367 39.9217 174.806 35.309 174.806 29.4104C174.793 28.0703 175.045 26.7409 175.549 25.4992C176.053 24.2575 176.799 23.1282 177.742 22.1768C178.686 21.2253 179.809 20.4707 181.047 19.9566C182.285 19.4425 183.612 19.1792 184.952 19.182ZM184.952 38.7478C189.846 38.7478 193.795 34.677 193.795 29.4104C193.795 24.2796 189.846 20.3558 184.952 20.3558C180.058 20.3558 176.098 24.2796 176.098 29.4104C176.098 34.6715 180.051 38.7478 184.952 38.7478Z"
              fill="white" />
            <path
              d="M10.6228 4.48227C10.6255 3.57898 10.8615 2.69171 11.3079 1.90643C11.7543 1.12114 12.396 0.464457 13.1707 0C4.72051 0.112057 0.015959 2.2044 0.015959 2.2044C0.015959 2.2044 -0.876819 20.4054 10.6926 31.7396C10.4935 30.581 10.7079 29.3892 11.2981 28.3725C11.8884 27.3558 12.8171 26.5788 13.922 26.1772C15.2502 25.4755 15.5551 21.9815 15.5551 17.7582C15.5551 13.6397 15.2685 10.2008 14.0194 9.38705C13.0225 9.01061 12.1637 8.33983 11.557 7.46378C10.9504 6.58774 10.6245 5.54787 10.6228 4.48227Z"
              fill="white" />
            <path
              d="M27.2752 1.53581C24.5291 0.924493 21.7464 0.491284 18.9444 0.238892C19.714 0.791776 20.319 1.54322 20.6949 2.41304C21.0708 3.28286 21.2035 4.23841 21.0789 5.17775C20.9542 6.11709 20.5769 7.00496 19.9871 7.74663C19.3974 8.4883 18.6173 9.05593 17.7302 9.38897C16.4792 10.2028 16.1926 13.6416 16.1926 17.7602C16.1926 21.9853 16.4976 25.4755 17.8257 26.1791C17.8478 26.1901 17.8735 26.1957 17.8937 26.2067L17.8165 26.1277C19.2347 26.7743 22.2143 24.2576 25.5521 20.9161C28.8899 17.5746 31.4121 14.6116 30.7674 13.1879L30.8225 13.243C30.4462 12.3212 30.3425 11.3107 30.5236 10.3317C30.7047 9.35263 31.1631 8.44616 31.8442 7.71995C32.5253 6.99374 33.4006 6.47832 34.3661 6.23493C35.3315 5.99154 36.3465 6.0304 37.2905 6.34691C34.3743 3.98206 30.944 2.33423 27.2752 1.53581Z"
              fill="white" />
            <path
              d="M40.6375 9.58545C40.8754 10.2324 40.9817 10.9203 40.9502 11.6089C40.9187 12.2975 40.7499 12.9728 40.4539 13.5953C40.1579 14.2178 39.7405 14.7749 39.2263 15.2339C38.7121 15.693 38.1114 16.0447 37.4595 16.2684C36.2967 17.1024 36.0266 20.0949 36.0266 23.666C36.0266 27.2371 36.3003 30.248 37.4723 31.0728C38.4317 31.4129 39.2709 32.0255 39.8873 32.8355C40.5037 33.6455 40.8705 34.6177 40.9426 35.633C41.0148 36.6483 40.7892 37.6625 40.2935 38.5516C39.7978 39.4406 39.0536 40.1657 38.152 40.638C44.8901 40.379 49.8904 39.0656 49.8904 39.0656C49.8904 39.0656 50.2891 20.8701 40.6375 9.58545Z"
              fill="white" />
            <path
              d="M33.5191 16.0922C32.0256 15.7652 29.182 18.1937 26.004 21.3662C22.6643 24.7095 20.1476 27.6891 20.7961 29.1073L20.7226 29.032C21.0285 29.7669 21.1629 30.562 21.1155 31.3566C21.0682 32.1513 20.8403 32.9248 20.4493 33.6182C20.0583 34.3117 19.5144 34.9069 18.859 35.3587C18.2035 35.8105 17.4537 36.107 16.6665 36.2256C17.65 36.7836 18.6638 37.2865 19.7031 37.732C24.099 39.5984 28.8293 40.3846 33.2105 40.605C32.3183 40.1256 31.5847 39.3974 31.0988 38.5087C30.6129 37.6201 30.3956 36.6094 30.4735 35.5996C30.5513 34.5898 30.9209 33.6244 31.5372 32.8208C32.1536 32.0171 32.9902 31.4099 33.9453 31.0729C35.1136 30.2481 35.3873 27.2501 35.3873 23.6661C35.3873 20.0821 35.1191 17.1025 33.9545 16.2685C33.8002 16.2171 33.6606 16.1546 33.5191 16.0922Z"
              fill="white" />
          </svg>

        </div>
        <div class="search_block">
          <input type="search" class="search-input" placeholder="Искать сотрудника, документ, прочее">
          <i class="bi bi-search search-icon" style="color: white; "></i>
        </div>
        <div class="menu_block">
          <div class="date_time">
            <p class="blue_text">{{ new Date().toLocaleDateString() }}</p>
            <p class="blue_text"> <!-- Линия -->
              <svg width="10" height="15" viewBox="0 0 2 65" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M1 0V65" stroke="white" />
              </svg>
            </p>
            <p class="blue_text">{{ currentTime }}</p>
          </div>
          <div class="user_block">
            <button class="hamburger" :class="{ active_hamburger: isVisibleMiniMenu }" 
              @click="isVisibleMiniMenu = !isVisibleMiniMenu">
              <img src="./assets/hamburger.png" style="width: 65%;">
            </button>

            <div class="user_pic" @click="isVisibleUserMenu = !isVisibleUserMenu">
              <img src="./assets/user.png" alt="логотип сотрудника">
            </div>
          </div>
        </div>

        <div class="mini_menu" ref="miniMenuRef" v-show="isVisibleMiniMenu">
          <div class="hot_keys_group">
            <hot_key_blue :figcaption="'Все\nсотрудники'" :classSize="'s_size'"><img
                src="@/pages/new_start_page/assets/circle.png" style="width: 70%; margin: 0 auto;" /></hot_key_blue>
            <hot_key_green :figcaption="'Служебные заявки'" :classSize="'s_size'"><img
                src="@/pages/new_start_page/assets/check2.png" style="width: 70%; margin: 0 auto;" alt="">
            </hot_key_green>
            <hot_key_blue :figcaption="'Финансовый отчет'" :classSize="'s_size'"><img
                src="@/pages/new_start_page/assets/rub3.png" style="width: 70%; margin: 0 auto;" alt=""></hot_key_blue>
            <hot_key_green :figcaption="'Служебные автомобили'" :classSize="'s_size'"><img
                src="@/pages/new_start_page/assets/wheel.png" style="width: 70%; margin: 0 auto;" alt="автомобили">
            </hot_key_green>
            <hot_key_blue :figcaption="'Обучение'" :classSize="'s_size'"><img
                src="@/pages/new_start_page/assets/graduation.png" style="width: 70%; margin: 0 auto;" alt="обучение">
            </hot_key_blue>
            <hot_key_green :figcaption="'Календарь мероприятий'" :classSize="'s_size'"><img
                src="@/pages/new_start_page/assets/calendar.png" style="width: 70%; margin: 0 auto;" alt="календарь">
            </hot_key_green>


            <hot_key_green :figcaption="'Электронный каталог'" :classSize="'s_size'"><img
                src="@/pages/new_start_page/assets/folder.png" style="width: 70%; margin: 0 auto;" alt="каталог">
            </hot_key_green>
            <hot_key_blue :figcaption="'Структура компании'" :classSize="'s_size'"><img
                src="@/pages/new_start_page/assets/structura.png" style="width: 70%; margin: 0 auto;"></hot_key_blue>
            <hot_key_green :figcaption="'Банк файлов'" :classSize="'s_size'"><img
                src="@/pages/new_start_page/assets/cloudy.png" style="width: 70%; margin: 0 auto;"> </hot_key_green>
            <hot_key_blue :figcaption="'Документы охрана труда'" :classSize="'s_size'"><img
                src="@/pages/new_start_page/assets/warning.png" style="width: 70%; margin: 0 auto;"></hot_key_blue>
            <hot_key_green :figcaption="'Приказы инструкции'" :classSize="'s_size'"><img
                src="@/pages/new_start_page/assets/mark.png" style="width: 70%; margin: 0 auto;"></hot_key_green>
            <hot_key_blue :figcaption="'График отпусков'" :classSize="'s_size'"><img
                src="@/pages/new_start_page/assets/graphik.png" style="width: 70%; margin: 0 auto;"></hot_key_blue>

          </div>
        </div>

        <div class="user_menu" ref="userMenuRef" v-show="isVisibleUserMenu">
          <div class="active_block">
            <div class="f_line">
              <img src="./assets/user.png" alt="логотип сотрудника" style="width: 20%; height: 20%;">
              <div class="description">
                <h5>Балина Светлана</h5>
                <span>Менеджер по маркетинговым коммуникациям</span>
              </div>
            </div>

            <button class="button_border">Перейти в личный кабинет</button>

          </div>
          <router-link to="/login" class="nav-link" @click="deleteTokenUser">
            <button class="exit_btn">
              <img src="./assets/off_btn.png">&nbsp;&nbsp;Выход
            </button>
          </router-link>
        </div>
      </div>

      <div class="row_3">
        <ul class="tabs_block">
          <li>
            <router-link to="/main" style="outline: none !important; text-decoration: none !important;">
              <button class="tab_button">Главная</button>
            </router-link>
          </li>
          <li><button class="tab_button">Новости</button></li>
          <li><button class="tab_button"><router-link to="/workspace" class="nav-link">Все
                сотрудники</router-link></button></li>
          <li><button class="tab_button">Служебные заявки</button></li>
          <li><button class="tab_button">Техподдержка</button></li>
        </ul>
      </div>
    </div>

  </nav>
</template>

<style scoped>
@import './style/style-navbar.scss';
</style>


<script>
import { ref, onMounted, onUnmounted, watchEffect, watch } from 'vue';
import hot_key_blue from '@/pages/new_start_page/ui/hot_key_blue_ui.vue';
import hot_key_green from '@/pages/new_start_page/ui/hot_key_green_ui.vue';
import { onClickOutside } from '@vueuse/core'
export default {
  components: {
    hot_key_blue,
    hot_key_green
  },
  setup() {
    // Создаем реактивную переменную для хранения текущего времени
    const currentTime = ref(getCurrentTime());
    const isVisibleMiniMenu = ref(false);
    const isVisibleUserMenu = ref(false)
    const miniMenuRef = ref(null);
    const userMenuRef = ref(null);



    

    // onClickOutside(miniMenuRef, event => isVisibleMiniMenu.value = false)
    // onClickOutside(userMenuRef, event => isVisibleUserMenu.value = false)


    // Функция для получения текущего времени в формате 'чч:мм:сс'
    function getCurrentTime() {
      const now = new Date();
      const hours = addLeadingZero(now.getHours());
      const minutes = addLeadingZero(now.getMinutes());
      return `${hours}:${minutes}`;
    }

    // Функция для добавления нуля перед числом, если оно однозначное (например, 1 -> '01')
    function addLeadingZero(number) {
      return number < 10 ? '0' + number : number;
    }
    const deleteTokenUser = () => {
      localStorage.clear()
    }
    watch(isVisibleMiniMenu, () => {
      if (isVisibleMiniMenu.value) {
        isVisibleUserMenu.value = false
      }
    })
    watch(isVisibleUserMenu, () => {
      if (isVisibleUserMenu.value) {
        isVisibleMiniMenu.value = false

      }
    })
    // Обновляем текущее время каждую секунду
    watchEffect((onInvalidate) => {
      const intervalId = setInterval(() => {
        currentTime.value = getCurrentTime();
      }, 1000);

      // Отменяем таймер при размонтировании компонента
      onInvalidate(() => {
        clearInterval(intervalId);
      });
    });

    // Возвращаем текущее время для отображения в шаблоне
    return {
      currentTime,
      isVisibleMiniMenu,
      isVisibleUserMenu,
      deleteTokenUser,

      miniMenuRef,
      userMenuRef,

    };
  }
};
</script>