<template>
  <nav class="navbar navbar-expand-lg">
    <div class="container-fluid mx-3"> <!-- Горизонтальные отступы -->
      <a class="navbar-brand" href="#">
        <svg width="80" height="50" viewBox="0 0 29 12" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path
            d="M18.2158 3.31108C18.591 3.51085 18.6771 4.35728 18.6771 5.37071C18.6771 6.4106 18.5845 7.26964 18.1863 7.44252C17.6061 7.63387 17.1945 8.09759 17.1945 8.64177C17.1945 8.70098 17.206 8.75521 17.2156 8.81143C13.737 6.02324 14.0048 1.54374 14.0048 1.54374C14.0048 1.54374 15.4185 1.02789 17.9601 1C17.5039 1.22821 17.1942 1.63449 17.1942 2.10352C17.1942 2.65545 17.6193 3.12648 18.2158 3.31108ZM22.2003 1.37906C21.3747 1.22821 20.538 1.12141 19.6955 1.05932C20.0911 1.2945 20.3507 1.6719 20.3507 2.10352C20.3507 2.65545 19.9255 3.12648 19.3308 3.31108C18.9543 3.51085 18.8683 4.35728 18.8683 5.37071C18.8683 6.4106 18.9608 7.26964 19.359 7.44252C19.3654 7.44473 19.3732 7.44794 19.3795 7.44982L19.3565 7.42968C19.783 7.58905 20.6782 6.96939 21.6828 6.1472C22.6846 5.3281 23.4427 4.59578 23.2513 4.2466L23.2665 4.25933C23.1945 4.10926 23.1571 3.94955 23.1562 3.7883C23.1562 3.07335 23.8627 2.49486 24.7363 2.49486C24.9033 2.49486 25.061 2.52275 25.2141 2.5616C24.397 2.02096 23.4077 1.59874 22.2003 1.37906ZM26.217 3.35989C26.2748 3.49336 26.312 3.63591 26.312 3.78841C26.312 4.34975 25.8742 4.82609 25.2613 5.00316C24.9119 5.20835 24.831 5.94477 24.831 6.82319C24.831 7.70603 24.9133 8.444 25.2652 8.64697C25.8754 8.82527 26.312 9.30249 26.312 9.86206C26.312 10.3577 25.9692 10.782 25.4695 11C27.4964 10.9366 28.9993 10.6132 28.9993 10.6132C28.9993 10.6132 29.1187 6.13569 26.217 3.35989ZM24.077 4.96022C23.6274 4.88021 22.7733 5.47795 21.8187 6.25754C20.8144 7.08084 20.0577 7.81416 20.2517 8.16223L20.2298 8.14485C20.3101 8.30226 20.3512 8.4712 20.3507 8.64177C20.3507 9.28899 19.7688 9.82022 19.0109 9.91496C19.2999 10.0475 19.6018 10.1737 19.9243 10.2862C21.2461 10.7456 22.668 10.9387 23.9848 10.9927C23.4938 10.7725 23.1561 10.3519 23.1561 9.86206C23.1561 9.30249 23.5941 8.82538 24.2056 8.64697C24.5563 8.444 24.6385 7.70603 24.6385 6.82319C24.6385 5.94477 24.5575 5.20824 24.208 5.00316C24.1635 4.99059 24.1198 4.97626 24.077 4.96022Z"
            fill="white" />
          <g clip-path="url(#clip0_1_16)">
            <path
              d="M0.281568 5.62447C-0.37646 2.581 1.47289 0.915641 3.5206 0.712337C5.23304 0.542383 6.96035 1.43097 8.09644 2.67073C5.362 1.72999 1.95808 3.06391 0.281568 5.62447ZM11.7184 6.37625C12.3765 9.41972 10.5272 11.0849 8.47961 11.2877C6.76716 11.4585 5.03965 10.5694 3.90366 9.32968C6.6381 10.2706 10.042 8.9367 11.7184 6.37625Z"
              fill="white" />
            <path
              d="M5.62436 11.7185C2.58089 12.3766 0.915637 10.5271 0.71223 8.47961C0.542276 6.76727 1.43087 5.03985 2.67062 3.90377C1.72989 6.6381 3.06391 10.042 5.62436 11.7185ZM6.37614 0.281672C9.41971 -0.376253 11.0849 1.4731 11.2879 3.5207C11.4586 5.23294 10.5695 6.96056 9.32978 8.09654C10.2705 5.36211 8.9366 1.95808 6.37614 0.281672Z"
              fill="white" />
          </g>
          <defs>
            <clipPath id="clip0_1_16">
              <rect width="12" height="12" fill="white" />
            </clipPath>
          </defs>
        </svg>



      </a>
      <!-- <a href=""> -->

      <!-- </a> -->
      <button class="navbar-toggler" type="button" data-bs-toggle="collapse" data-bs-target="#navbarSupportedContent"
        aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
        <span class="navbar-toggler-icon"></span>
      </button>
      <div class="collapse navbar-collapse" id="navbarSupportedContent">
        <ul class="navbar-nav me-auto mb-2 mb-lg-0">

          <li class="nav-item dws">
            <router-link to="/about-company" class="nav-link">О компаниях</router-link>
          </li>
          <li class="nav-item dws">
            <router-link to="/products" class="nav-link">Продукция</router-link>
          </li>
          <li class="nav-item dws">
            <router-link to="/workspace" class="nav-link">Рабочая среда</router-link>
          </li>

          <li class="nav-item dws">
            <router-link to="/login" class="nav-link" @click="deleteTokenUser">Выход</router-link>
          </li>
        </ul>

        <!-- <form class="d-flex"> -->

        <router-link to="/login" class="nav-link">
          <div class="icon_block"></div>
        </router-link>
        <!-- </form> -->
      </div>
    </div>
  </nav>
</template>

<style  scoped>
@import './style/style-navbar.scss';
</style>


<script>
export default {
  setup() {
    const deleteTokenUser = () => {
      localStorage.removeItem('accessToken')
      localStorage.removeItem('refreshToken')
    }
    return {
      deleteTokenUser
    }
  }
}
</script>