<template>
    <div>
        <!-- <navbar /> -->
        <div class="air_block">
            <div class="air_block_header">
                <h3 class="header_element">Продукция</h3>
                <hr>
            </div>
            <div class="air_body">
                <div class="air_element">
                    <img src="./assets/aqua1.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="blue"><b>АКВАПИЛИНГ экспресс-педикюр от мозолей и натоптышей 150 мл</b> <br>
                                Устранение огрубевшей кожи и натоптышей за 15 минут. В составе: гидроокись калия, тетраборат
                                натрия.</span> <br>
                            Устранение утолщенного огрубевшего слоя кожи подошв, омозолелостей и натоптышей, в том
                            числе:<br>
                            – при гиперкератической форме микоза стоп;<br>
                            – при псориазе, кератодермии и т. п.<br>
                        </p>
                    </div>
                </div>
                <div class="air_element">
                    <img src="./assets/aqua2.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="blue"><b>АКВАПИЛИНГ крем от мозолей и натоптышей 75 мл </b><br>
                                Устранение гиперкератоза на любых участках тела за 7 дней.<br>
                                В составе: мочевина 25%, натуральные масла (мята, лаванда, эвкалипт), экстракты ромашки
                                и зеленого чая.<br>
                            </span> <br>
                            – при гиперкератозе подошв, локтей, коленей и т. д.;<br>
                            – при кератодермии;<br>
                            – при гиперкератотической форме грибка стопы;<br>
                            – при трещинах на участках гиперкератоза.<br>

                        </p>
                    </div>
                </div>
                <div class="air_element">
                    <img src="./assets/a4.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="blue"><b>АКВАПИЛИНГ крем д/рук от огрубевшей кожи и сухих мозолей 75 мл</b><br>
                                В составе: мочевина 15%, натуральные масла, витамин Е, пантенол и алое вера. <br>
                            </span>
                            – размягчает огрубевшую кожу;<br>
                            – питает, увлажняет и смягчает кожу рук;<br>
                            – улучшает регенерацию, способствует быстрому восстановлению здоровой кожи.<br>

                        </p>
                    </div>
                </div>
                <div class="air_element">
                    <img src="./assets/a5.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="blue"><b>АКВАПИЛИНГ крем-паста от натоптышей 20 мл</b><br>
                                Устранение плотных участков огрубевшей кожи. <br>
                                Видимый эффект с первого применения.<br>
                                В составе: мочевина 40%.
                            </span> <br>
                            – размягчает натоптыши и сухие мозоли даже каменистой плотности.
                        </p>
                    </div>
                </div>
                <div class="air_element">
                    <img src="./assets/a6.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="orange"><b>СКИН-АКТИВ крем с гиалуроновой кислотой 75 мл </b><br>
                                Увлажнение и восстановление нормальной структуры кожи. <br>
                                В составе: гиалуроновая кислота, молочная кислота, мочевина, пантенол, витамины Е и РР,<br>
                                физиологические липиды натуральных масел (оливковое, авокадо).
                            </span> <br>
                            – обладает многосторонним механизмом увлажнения;<br>
                            – поддерживает защитный барьер кожи.
                        </p>
                    </div>
                </div>
                <div class="air_element">
                    <img src="./assets/a7.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="orange"><b>СКИН-АКТИВ эмульсия для тела с гиалуроновой кислотой 250 мл</b><br>
                                Увлажнение и восстановление нормальной структуры кожи.<br>
                                В составе: гиалуроновая кислота, молочная кислота, мочевина, пантенол, витамины Е и РР,<br>
                                физиологические липиды натуральных масел (оливковое, авокадо).
                            </span> <br>
                            – обладает многосторонним механизмом увлажнения; <br>
                            – поддерживает защитный барьер кожи. <br>

                        </p>
                    </div>
                </div>
                <div class="air_element">
                    <img src="./assets/a8.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="yellow"><b>АЛГЕЛЬ МАКСИМУМ дезодорант-антиперспирант роликовый флакон 50 мл </b>
                                <br>
                                Медицинский антиперспирант длительного действия с усиленной формулой и двойным эффектом.
                                <br>
                                В составе: алюминия хлоргидрат 25%, тетранил У, сок алоэ вера, аллантоин, мятное масло.<br>
                            </span> <br>
                            – максимальный контроль над потоотделением; <br>
                            – подавляет размножение грибов и бактерий, вызывающих запах; <br>
                            – не содержит спирта, успокаивает кожу. <br>
                        </p>
                    </div>
                </div>

            </div>
        </div>

    </div>
</template>



<style scoped>
@import './style/products-page-style.scss';
</style>
<script>
import navbar from '../../components/navbar/navbar.vue';
export default {
    components: { navbar },
    setup() {

    },
}
</script>