<template>
    <div>
        <vue-final-modal v-model="isModal" classes="modal-container" content-class="modal-content">
            <button class="modal__close" @click="isModal = false">
                <i class="bi bi-x-lg"></i>
            </button>
            <span class="modal__title" :class="classModalTitle">{{ modalTitle }}</span>
            <div class="block_info">
                <img :src="modalImg" alt="Фото товара">
                <div class="text" v-html="modalText">
                  
                </div>
            </div>
        </vue-final-modal>

        <!-- <navbar /> -->
        <div class="air_block">
            <div class="air_block_header">
                <h3 class="header_element">Продукция</h3>
                <hr>
            </div>
            <div class="air_body">
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'aqua1.jpg')">
                    <img src="./assets/aqua1.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="blue"><b>АКВАПИЛИНГ экспресс-педикюр от мозолей и натоптышей 150 мл</b> <br>
                                Устранение огрубевшей кожи и натоптышей за 15 минут. В составе: гидроокись калия, тетраборат
                                натрия.</span> <br>
                            Устранение утолщенного огрубевшего слоя кожи подошв, омозолелостей и натоптышей, в том
                            числе:<br>
                            – при гиперкератической форме микоза стоп;<br>
                            – при псориазе, кератодермии и т. п.<br>
                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'aqua2.jpg')">
                    <img src="./assets/aqua2.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="blue"><b>АКВАПИЛИНГ крем от мозолей и натоптышей 75 мл </b><br>
                                Устранение гиперкератоза на любых участках тела за 7 дней.<br>
                                В составе: мочевина 25%, натуральные масла (мята, лаванда, эвкалипт), экстракты ромашки
                                и зеленого чая.<br>
                            </span> <br>
                            – при гиперкератозе подошв, локтей, коленей и т. д.;<br>
                            – при кератодермии;<br>
                            – при гиперкератотической форме грибка стопы;<br>
                            – при трещинах на участках гиперкератоза.<br>

                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a4.jpg')">
                    <img src="./assets/a4.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="blue"><b>АКВАПИЛИНГ крем д/рук от огрубевшей кожи и сухих мозолей 75 мл</b><br>
                                В составе: мочевина 15%, натуральные масла, витамин Е, пантенол и алое вера. <br>
                            </span>
                            – размягчает огрубевшую кожу;<br>
                            – питает, увлажняет и смягчает кожу рук;<br>
                            – улучшает регенерацию, способствует быстрому восстановлению здоровой кожи.<br>

                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a5.jpg')">
                    <img src="./assets/a5.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="blue"><b>АКВАПИЛИНГ крем-паста от натоптышей 20 мл</b><br>
                                Устранение плотных участков огрубевшей кожи. <br>
                                Видимый эффект с первого применения.<br>
                                В составе: мочевина 40%.
                            </span> <br>
                            – размягчает натоптыши и сухие мозоли даже каменистой плотности.
                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a6.jpg')">
                    <img src="./assets/a6.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="orange"><b>СКИН-АКТИВ крем с гиалуроновой кислотой 75 мл </b><br>
                                Увлажнение и восстановление нормальной структуры кожи. <br>
                                В составе: гиалуроновая кислота, молочная кислота, мочевина, пантенол, витамины Е и РР,<br>
                                физиологические липиды натуральных масел (оливковое, авокадо).
                            </span> <br>
                            – обладает многосторонним механизмом увлажнения;<br>
                            – поддерживает защитный барьер кожи.
                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a7.jpg')">
                    <img src="./assets/a7.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="orange"><b>СКИН-АКТИВ эмульсия для тела с гиалуроновой кислотой 250 мл</b><br>
                                Увлажнение и восстановление нормальной структуры кожи.<br>
                                В составе: гиалуроновая кислота, молочная кислота, мочевина, пантенол, витамины Е и РР,<br>
                                физиологические липиды натуральных масел (оливковое, авокадо).
                            </span> <br>
                            – обладает многосторонним механизмом увлажнения; <br>
                            – поддерживает защитный барьер кожи. <br>

                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a8.jpg')">
                    <img src="./assets/a8.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="yellow"><b>АЛГЕЛЬ МАКСИМУМ дезодорант-антиперспирант роликовый флакон 50 мл </b>
                                <br>
                                Медицинский антиперспирант длительного действия с усиленной формулой и двойным эффектом.
                                <br>
                                В составе: алюминия хлоргидрат 25%, тетранил У, сок алоэ вера, аллантоин, мятное масло.<br>
                            </span> <br>
                            – максимальный контроль над потоотделением; <br>
                            – подавляет размножение грибов и бактерий, вызывающих запах; <br>
                            – не содержит спирта, успокаивает кожу. <br>
                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a9.jpg')">
                    <img src="./assets/a9.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="yellow"><b>АЛГЕЛЬ антиперспирант роликовый флакон 50 мл </b><br>
                                Медицинский антиперспирант длительного действия. <br>
                                В составе: алюминия хлоргидрат 20%, экстракт шалфея, зеленого чая, ромашки. <br>
                            </span> <br>
                            Длительность действия от 2 до 5 дней. <br>
                            Экстракт шалфея, зеленого чая и ромашки оказывает успокаивающее, противовоспалительное и
                            дезодорирующее действие. <br>
                            – устраняет повышенное потоотделение и запах в аксиллярных областях (зона подмышечной впадины) и
                            на ладонях.

                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a10.jpg')">
                    <img src="./assets/a10.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="yellow"><b>АЛГЕЛЬ антиперспирант для ног 20 мл, 75 мл</b><br>
                                Медицинский антиперспирант длительного действия.<br>
                                В составе: алюминия хлоргидрат 15%, экстракт шалфея, зеленого чая, ромашки. <br>
                            </span> <br>
                            Длительность действия от 2 до 4 дней. <br>
                            Экстракт шалфея, зеленого чая и ромашки оказывает успокаивающее, противовоспалительное и
                            дезодорирующее действие.<br>
                            – устраняет избыточную потливость и неприятный запах ног.
                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a11.jpg')">
                    <img src="./assets/a11.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="red"><b>МИКОСТОП набор 2 в 1</b><br>
                                В наборе: Микостоп крем-паста, Микостоп средство (лосьон). <br>
                                Комплексный подход к лечению грибка ногтей по выгодной цене. <br>
                            </span> <br>
                            Крем-паста: безболезненное удаление участков ногтей, пораженных грибком. <br>
                            Лосьон: устранение грибковых поражений ногтей.
                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a12.jpg')">
                    <img src="./assets/a12.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="red"><b>МИКОСТОП набор 3 в 1</b><br>
                                В наборе: Микостоп крем-паста, Микостоп средство (лосьон),<br>
                                Микостоп дезинфицирующее средство (гигиенический спрей). <br>
                                Комплексный подход к лечению грибка ногтей по выгодной цене. <br>
                            </span> <br>
                            Крем-паста: безболезненное удаление участков ногтей, пораженных грибком. <br>
                            Лосьон: устранение грибковых поражений ногтей. <br>
                            Спрей: для противогрибковой обработки обуви с целью профилактики повторного заражения. <br>

                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a13.jpg')">
                    <img src="./assets/a13.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="red"><b>МИКОСТОП крем-паста для удаления участков ногтей, пораженных грибком, 20
                                    мл</b><br>
                                Удаление участков ногтей, пораженных грибком. Без боли. В домашних условиях. В составе:
                                мочевина 40%. <br>
                            </span> <br>
                            – сочетается с любыми противогрибковыми препаратами; <br>
                            – уникальная форма (крем-паста) обеспечивает устойчивую длительную адгезию с ногтевой пластиной;
                            <br>
                            – безболезненно удаляет пораженную грибком ногтевую пластину. <br>

                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a14.jpg')">
                    <img src="./assets/a14.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="red"><b>МИКОСТОП средство (лосьон) для восстановления и защиты ногтевой пластины
                                    при грибковом поражении 15 мл</b><br>
                                Устранение грибковых поражений ногтей, защита от грибковой инфекции, восстановление
                                здорового ногтя. <br>
                                В составе: молочная кислота, никотиновая кислота. <br>

                            </span> <br>
                            – проникает на всю толщу ногтевой пластины и устраняет грибок; <br>
                            – улучшает кровообращение в подногтевой области, ускоряя рост здорового ногтя и способствуя его
                            восстановлению; <br>
                            – образует водоотталкивающую пленку на поверхности ногтя, препятствуя распространению грибка.


                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a15.jpg')">
                    <img src="./assets/a15.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="red"><b>МИКОСТОП крем для ног противогрибковый 75 мл</b><br>
                                Устранение грибка стопы с гиперкератозом. <br>
                                В составе: тетранил У 1,5%, мочевина 10%.<br>
                            </span> <br>
                            – размягчает и отшелушивает огрубевший слой кожи, обеспечивая доступ противогрибкового
                            компонента к месту локализации грибка; <br>
                            – обладает фунгицидным действием; <br>
                            – имеет качественную кремовую основу, без вазелина; <br>
                            – хорошо впитывается, не оставляя жирных следов. <br>
                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a16.jpg')">
                    <img src="./assets/a16.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="red"><b>МИКОСТОП дезинфицирующее средство (гигиенический спрей) для
                                    противогрибковой обработки обуви и профилактики заражения грибком 150 мл</b><br>
                                Противогрибковая обработка обуви и профилактика заражения грибком. <br>
                                В составе: тетранил У
                                2%.<br>
                            </span> <br>
                            – противогрибковая обработка обуви при микозах стоп; <br>
                            – профилактика заражения микозами стоп после контакта с поверхностями и предметами, потенциально
                            зараженными грибком.

                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a17.jpg')">
                    <img src="./assets/a17.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="red"><b> МИКОСТОП дезодорант-антиперспирант для ног 150 мл </b><br>
                                Устранение неприятного запаха ног при повышенной потливости. <br>
                                В составе: тетранил У 2%, хлоргидрат алюминия 5%.<br>
                            </span> <br>
                            – устраняет неприятный запах; <br>
                            – нормализует потоотделение; <br>
                            – подавляет размножение бактерий и грибков.
                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a18.jpg')">
                    <img src="./assets/a18.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="yellow"><b> МИКОЛЕПТ лак для ухода за ногтями
                                    с признаками поражения грибком 10 мл
                                </b><br>
                                В составе: молочная кислота, циклопирокс 8%.<br>
                            </span> <br>
                            Форма «гидролак» инновационное сочетание раствора и лака — обеспечивает быстрое проникновение
                            двух активных компонентов в ногтевую пластину
                            и поддерживает эффективную концентрацию в течение 24 часов. Единственный гидролак на основе
                            циклопирокса в РФ! <br>
                            – прекращает рост и размножение грибов; <br>
                            – восстанавливает здоровую ногтевую пластину; <br>
                            – обеспечивает защиту от заражения грибком.

                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a19.jpg')">
                    <img src="./assets/a19.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="yellow"><b>МИКОЛЕПТ крем для улучшения состояния кожи при признаках поражения
                                    грибком 40 мл
                                </b><br>
                                В составе: циклопирокс 1%, климбазол 0,5%, полидоканол 2% <br>
                            </span> <br>
                            Единственный крем с Циклопироксом в РФ! Аналогов нет! <br>
                            Уникальная комбинация противогрибковых и противозудного компонентов:<br>
                            – прекращает рост и размножение грибков;<br>
                            – обеспечивает быстрый и выраженный противозудный эффект;<br>
                            – защищает от повторного заражения.
                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a20.jpg')">
                    <img src="./assets/a20.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="red"><b>СТОПМОЛЛЮСК раствор для местного нанесения 5 мл</b><br>
                                Удаление контагиозного моллюска без боли и рубцов. <br>
                                В составе: 5% гидроокись калия.<br>
                            </span> <br>
                            – обеспечивает эффективную деструкцию высыпаний контагиозного моллюска при использовании от 2 до
                            10 дней; <br>
                            – можно использовать с 2 лет.
                        </p>
                    </div>
                </div>

                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a21.jpg')">
                    <img src="./assets/a21.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="turquoise"><b>НЕОТАНИН крем для детей и взрослых 50 мл</b><br>
                                В составе: синтетический танин 2%, полидоканол 2%. <br>
                                Быстро и надолго устраняет зуд, раздражение, покраснение и восстанавливает поврежденную
                                кожу. <br>

                            </span> <br>
                            Подходит для детей с рождения и беременных. Не содержит гормонов. Удобно наносить на локальные
                            участки. <br>
                            – при экземе, атопическом дерматите, крапивнице; <br>
                            – при аллергическом, контактном дерматите; <br>
                            – при пеленочном дерматите, опрелостях; <br>
                            – при других состояниях, сопровождающихся зудом кожи (укусы насекомых; фитодерматиты; бытовые,
                            химические, солнечные ожоги легкой и средней степени; психогенный, лекарственный зуд и т. д.).

                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a22.jpg')">
                    <img src="./assets/a22.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="turquoise"><b>НЕОТАНИН лосьон (суспензия) для детей и взрослых 100 мл</b><br>
                                В составе: синтетический танин 2%, полидоканол 5%, оксид цинка 5%. <br>
                                Быстро и надолго устраняет зуд, раздражение, покраснение, деликатно подсушивает и
                                восстанавливает поврежденную кожу. <br>
                            </span> <br>
                            Подходит для детей с рождения и беременных. Не содержит гормонов. Удобно для точечного нанесения
                            на высыпания и эрозии. <br>
                            – при ветряной оспе, герпесе, опоясывающем лишае; <br>
                            – при всех зудящих дерматозах, в том числе сопровождающихся экссудацией (мокнутием); <br>
                            – при бактериальных инфекциях кожи (пиодермии, импетиго).
                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a23.jpg')">
                    <img src="./assets/a23.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="turquoise"><b>НЕОТАНИН спрей для детей и взрослых 100 мл</b><br>
                                В составе: синтетический танин 2%, полидоканол 5%. <br>
                                Быстро и надолго устраняет зуд, раздражение, покраснение и восстанавливает поврежденную
                                кожу. <br>

                            </span> <br>
                            Подходит для детей с рождения и беременных. Не содержит гормонов. Удобно для нанесения на
                            обширные и труднодоступные участки кожи. <br>
                            – при ветряной оспе, герпесе, опоясывающем лишае; <br>
                            – при всех зудящих дерматозах, в том числе сопровождающихся экссудацией (мокнутием); <br>
                            – при бактериальных инфекциях кожи (пиодермии, импетиго); <br>
                            – при других состояниях, сопровождающихся зудом кожи (укусы насекомых; фитодерматиты; легкие
                            бытовые, химические и солнечные ожоги и т. д.).

                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a24.jpg')">
                    <img src="./assets/a24.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="turquoise"><b>НЕОТАНИН КОМФОРТ ПЛЮС крем 250 мл</b><br>
                                В составе: натуральные масла (подсолнечника, карите, сои), полидоканол, мочевина, экстракты
                                алоэ вера, ромашки и календулы, витамин Е. <br>
                                Устраняет сухость, стянутость, зуд и раздражение кожи. рН 5,5. <br>
                            </span> <br>
                            Оптимально подходит для зрелой кожи. Не содержит гормонов, минеральных масел, парабенов,
                            искусственных ароматизаторов и красителей. <br>
                            Подходит для регулярного длительного применения. <br>
                            – при возрастных изменениях кожи (сухость, стянутость, снижение эластичности); <br>
                            – при зуде и раздражении кожи на фоне хронических дерматитов; <br>
                            – при сухости и дискомфорте кожи как симптомы других заболеваний; <br>
                            – при повреждении кожи вследствие ежедневных вредных воздействий (жесткая вода, сухой воздух и
                            др.).


                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a25.jpg')">
                    <img src="./assets/a25.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="turquoise"><b>НЕОТАНИН ТРИАКТИВ гель для губ 10 мл</b><br>
                                В составе: синтетический танин, полидоканол, дикалий глицирризинат, Д-пантенол, аллантоин.
                                <br>
                                За счет комбинированного действия пяти активных компонентов снимает зуд, боль, покалывание,
                                устраняет покраснение и раздражение, оказывает подсушивающее, противовирусное и
                                противовоспалительное действие. <br>

                            </span> <br>
                            – при острых поражениях красной каймы губ, кожи губ и лица, обусловленных вирусом простого
                            герпеса (лабиальный герес); <br>
                            – для устранения покраснения, раздражения и профилактики герпетических высыпаний после контурной
                            коррекции или татуажа губ.

                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a26.jpg')">
                    <img src="./assets/a26.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="orange"><b>ЛИПОБЕЙЗ эмульсия для тела 250 мл, 400 мл</b><br>
                                Комплексный уход за кожей с признаками сухости, раздражения и зуда <br>
                                (для нанесения на все тело). В составе: церамиды и фитостеролы, натуральные масла <br>
                                (оливковое, авокадо, ши, бораго), мочевина, молочная кислота, витамины А и Е, бисаболол.
                                <br>
                            </span> <br>
                            – имеет липидный состав, идентичный натуральному, восстанавливает состав и структуру защитного
                            кожного барьера; <br>
                            – обладает комплексным механизмом увлажнения кожи; <br>
                            – не содержит минеральных масел, полностью впитывается, не оставляет жирного блеска.

                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a27.jpg')">
                    <img src="./assets/a27.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="orange"><b>ЛИПОБЕЙЗ бальзам интенсивный для сухой и очень сухой кожи 150 мл</b><br>
                                Интенсивный уход за очень сухой и атопичной кожей, в том числе на фоне хронических изменений
                                <br>
                                (атопический дерматит, экзема, псориаз и др.). В составе: натуральные масла (ши и <br>
                                кокосовое), усиленный увлажняющий комплекс из 3 компонентов (мочевина, гиалуроновая кислота,
                                br
                                молочная кислота), бета-глюкан овса, Д-пантенол, витамины А и Е. <br>
                            </span> <br>
                            – плотная, насыщенная текстура для интенсивного питания и длительного увлажнения кожи; <br>
                            – сбалансированный под потребности очень сухой и атопичной кожи комплекс природных масел и
                            увлажняющих компонентов; <br>
                            – уникальный компонент, бета-глюкан овса, для восстановления микробиома кожи и укрепления
                            естественных защитных функций кожи.
                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a28.jpg')">
                    <img src="./assets/a28.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="orange"><b>ЛИПОБЕЙЗ шампунь увлажняющий 250 мл</b><br>
                                Для ежедневного ухода за чувствительной, сухой кожей головы и волосами. <br>
                                В составе: комплекс натуральных масел, Д-пантенол, мочевина, инулин, витамины А и Е.
                                <br>
                            </span> <br>
                            – бережно очищает волосы и кожу головы; <br>
                            – увлажняет и успокаивает чувствительную и сухую кожу головы; <br>
                            – защищает от воздействия жесткой воды и от пересыхания; <br>
                            – укрепляет волосы, делает их более гладкими, блестящими и шелковистыми.

                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a29.jpg')">
                    <img src="./assets/a29.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="orange"><b>ЛИПОБЕЙЗ увлажняющий бальзам-ополаскиватель для волос и кожи головы 250
                                    мл</b><br>
                                Предназначен для ежедневного ухода за чувствительной и сухой кожей головы и волос. <br>
                                В составе: натуральные масла, бета-глюкан овса, аминокислоты, бетаин.
                                <br>
                            </span> <br>
                            – нормализует гидролипидный баланс эпидермиса кожи головы, не позволяет влаге испаряться,
                            поддерживает ее физиологический рН; <br>
                            – благоприятно воздействует на волосы, закрывает и восстанавливает чешуйки, делая волосы более
                            плотными, блестящими и послушными,
                            предотвращает электризацию волос.

                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a30.jpg')">
                    <img src="./assets/a30.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="orange"><b>ЛИПОБЕЙЗ бальзам-барьер для губ и лица «Восстанавливающий» 15 мл
                                </b><br>
                                Специальное средство для ухода за сухой и чувствительной кожей губ и локальными участками
                                раздражения на лице на основе натуральных масел. <br>
                                В составе: натуральные масла (ши, кокосовое, жожоба, макадамии, авокадо), Д-пантенол,
                                витамин Е, дикалий глицирризинат, бисаболол. <br>
                            </span> <br>
                            – обеспечивает кожу необходимым комплексом липидов для восстановления и поддержания защитного
                            слоя; <br>
                            – питает и устраняет сухость кожи; <br>
                            – устраняет воспаление и раздражение, успокаивает чувствительную кожу.
                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a31.jpg')">
                    <img src="./assets/a31.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="orange"><b>ЛИПОБЕЙЗ baby крем детский 75 мл</b><br>
                                Комплексный уход за чувствительной детской кожей с признаками сухости, шелушения, зуда и
                                <br>
                                раздражения (для локального нанесения). В составе: физиологические липиды натуральных масел
                                <br>
                                (макадамии, оливковое, кокосовое, зародышей пшеницы), экстракт розмарина, Д-пантенол, <br>
                                витамин Е, хлопковое молочко. <br>
                            </span> <br>
                            На основе ценных натуральных масел. Гипоаллергенная формула 0+. <br>
                            Не содержит минеральных масел, вазелина, парабенов, отдушек.
                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a32.jpg')">
                    <img src="./assets/a32.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="orange"><b>ЛИПОБЕЙЗ baby детская эмульсия для тела 200 мл</b><br>
                                Ежедневный уход за чувствительной кожей ребенка с признаками сухости, шелушения, раздражения
                                и зуда (для нанесения на все тело). <br>
                                В составе: физиологические липиды натуральных масел (оливковое, кокосовое, зародышей
                                пшеницы), экстракт розмарина, Д-пантенол, витамин Е, хлопковое молочко. <br>
                            </span> <br>
                            На основе ценных натуральных масел. Гипоаллергенная формула 0+. <br>
                            Не содержит минеральных масел, вазелина, парабенов, отдушек.
                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a33.jpg')">
                    <img src="./assets/a33.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="orange"><b>ЛИПОБЕЙЗ baby масло для купания 200 мл <br>
                                    ЛИПОБЕЙЗ масло для душа и ванны 200 мл</b><br>
                                Гигиенический уход за кожей детей и взрослых при состояниях, сопровождающихся <br>
                                сухостью, шелушением и раздражением, в том числе при хронических дерматитах (атопический
                                <br>
                                дерматит, экзема). В составе: физиологические липиды натуральных масел (соевое, макадамии,
                                <br>
                                оливковое, миндальное, зародышей пшеницы), триглицериды, экстракт розмарина, витамин Е.

                            </span> <br>
                            На основе ценных натуральных масел. Не содержит ПАВ, парабенов, минеральных масел, вазелина.
                            Гипоаллергенная формула, 0+. <br>
                            – бережное очищение кожи без мыла и вредных пенообразователей; <br>
                            – защита от негативного воздействия жесткой воды
                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a34.jpg')">
                    <img src="./assets/a34.jpg" alt="">
                    <div class="air_element_text">
                        <p>
                            <span class="orange"><b>ЛИПОБЕЙЗ baby масло детское для ухода и массажа 150 мл</b><br>
                                Идеально подходит для массажных процедур и ежедневного ухода за кожей детей и взрослых с
                                <br>
                                чувствительной кожей, требующей бережного ухода. <br>
                                В составе: натуральные масла (соевое, кокосовое, ши, макадамии), витамин Е, экстракт
                                розмарина.
                            </span> <br>
                            – за счет комплекса натуральных масел питает и успокаивает кожу; <br>
                            – нежная, шелковистая текстура без ощущения липкости обеспечивает эластичность и увлажненность
                            кожи; <br>
                            – 98% натуральных масел.
                        </p>
                    </div>
                </div>
                <div class="air_element" @click="openModalWithCurrentData($event.target, 'a35.jpg')">
                    <img src="./assets/a35.jpg" alt="">

                    <div class="air_element_text">
                        <p>
                            <span class="orange"><b>ЛИПОБЕЙЗ baby шампунь увлажняющий 150 мл</b><br>
                                Бережно очищает детские волосы, увлажняет кожу головы, облегчает расчесывание волос. <br>
                                В составе: масло макадамии, Д-пантенол, дикалий глицирризинат, натуральные бетаин и инулин.
                                <br>
                            </span> <br>
                            – ультрамягкие ПАВ получены из сырья растительного происхождения, создают пушистую пену, хорошо
                            смываются водой; <br>
                            – имеет нейтральный рН; <br>
                            – формула одобрена дерматологами, «без слез».
                        </p>
                    </div>
                </div>

            </div>
        </div>
    </div>
</template>



<script>
import { $vfm, VueFinalModal, ModalsContainer } from 'vue-final-modal'
import { ref } from 'vue';
import navbar from '../../components/navbar/navbar.vue';
export default {
    components: { navbar, VueFinalModal, ModalsContainer },
    setup() {
        const isModal = ref(false)
        const modalTitle = ref("")
        const classModalTitle = ref("")
        const modalText = ref("")
        const modalImg = ref("")
        // const openModalWithCurrentData = (data, img) => {
        //     modalTitle.value = data.getElementsByTagName("b")[0].innerText
        //     modalImg.value = new URL(`./assets/${img}`, import.meta.url).href
        //     modalText.value = data.innerText
        //     classModalTitle.value = data.getElementsByTagName("span")[0]?.classList[0]
        //     isModal.value = true
        // }
        const openModalWithCurrentData = (data, img) => {
            const bElement = data.querySelector("b");
            modalTitle.value = bElement.innerText;
            modalImg.value = new URL(`./assets/${img}`, import.meta.url).href;
            modalText.value = data.innerHTML;
            const spanElement = data.querySelector("span");
            classModalTitle.value = spanElement?.classList[0];
            isModal.value = true;
        }
        return {
            isModal,
            modalTitle,
            modalText,
            modalImg,
            classModalTitle,
            openModalWithCurrentData
        }
    },
}
</script>



<style scoped>
@import './style/products-page-style.scss';
</style>