<template>
    <div>
        <!-- <navbar /> -->
        <div class="air_block">
            <div class="air_block_header">
                <h3 class="header_element">О компании</h3>
                <hr>
            </div>
            <div class="about_company">

                <div class="ph">
                    <div class="logo">
                        <div class="logo_img">
                            <img src="./assets/farmtec.png" alt="логотип фармтека">
                        </div>
                    </div>
                    <div class="logo_text">

                        <p>В 2007 году впервые возникла идея создания компании, способной обеспечить врачей и пациентов
                            качественными и
                            эффективными препаратами по доступной цене. В мае 2009 прошли первые отгрузки средств,
                            инновационных
                            для
                            отечественного рынка. На тот момент в штате компании было 4 человека, а в портфеле – 6
                            препаратов.
                            Так
                            начиналась
                            история компании «Фармтек». Сегодня «Фармтек» — это 15 лет стремительного роста и уникального
                            опыта,
                            представители в
                            56 городах страны и 53 высокоэффективных препарата, заслуживших доверие специалистов и любовь
                            покупателей.
                            Продукцию </p>
                        <p> «Фармтек» можно найти в 70 000 аптек по всей России.
                            Строгий научный подход к разработке продукции, концентрация усилий в одном терапевтическом
                            направлении и большой
                            практический опыт менеджмента, обеспечивает уверенное развитие «Фармтек» в области дерматологии.
                            Все
                            средства
                            производятся с соблюдением международных стандартов качества. Препараты проходят клинические
                            испытания на базе
                            ведущих российских научно-клинических учреждений и обладают доказанной эффективностью.</p>
                    </div>
                </div>

                <div class="intelbio">
                    <div class="logo">
                        <div class="logo_img">
                            <img src="./assets/intelbio.png" alt="логотип интелбио">
                        </div>
                    </div>
                    <div class="logo_text">

                        <p>Научно-производственная компания «ИНТЕЛБИО» — молодая, динамично развивающаяся российская
                            фармацевтическая
                            компания.
                            Компания занимается научной разработкой, производством, дистрибуцией и активным продвижением
                            препаратов для
                            лечения
                            и профилактики различных заболеваний и состояний кожи. Всего за 5 лет работы компания «ИнтелБио»
                            выпустила ряд
                            оригинальных препаратов, не имеющих аналогов на российском рынке. </p>
                        <p>Наша миссия - держать руку на пульсе передовых научных разработок в области медицины вообще и
                            дерматологии в
                            частности, активно использовать достижения мировой науки для разработки наиболее эффективных,
                            доступных и
                            безопасных
                            препаратов, которые помогают решить существующие проблемы пациентов и значительно повысить их
                            качество жизни.</p>
                    </div>
                </div>

            </div>
        </div>
    </div>
</template>

<style scoped>
@import './style/style-about_company.scss';
</style>
<script>
import navbar from '../../components/navbar/navbar.vue';
export default {
    components: { navbar },
    setup() {

    },
}
</script>