<template>
    <div class="wrapper_cont div_full">
        <div class="container">


            <div class="row">
                <div id="content" class="col-md-12">
                    <!-- <ul class="breadcrumb">
                        <li><a href="http://pharmtec.ru/">Главная</a></li>
                        <li><span>О компании Фармтек</span></li>
                    </ul> -->

                    <h1>О компании</h1>
                    <div class="info">
                        <div class="container">
                            <div class="about-page">
                                <div class="year-wrapper">
                                    <div class="older">
                                        <div class="seven-year"><span>2007</span>
                                            <p>В 2007 году впервые возникла идея создания компании, способной обеспечить
                                                врачей и пациентов качественными и эффективными препаратами по доступной
                                                цене.</p>
                                        </div>
                                        <div class="nine-year"><span>2009</span>
                                            <p>В мае 2009 прошли первые отгрузки средств, инновационных для
                                                отечественного рынка. На тот момент в штате компании было 4 человека, а
                                                в портфеле – 6 препаратов. Так начиналась история компании «Фармтек»</p>
                                        </div>
                                    </div>
                                    <div class="today"><iframe width="100%" height="315"
                                            src="https://www.youtube.com/embed/GtYQ49Egv-s" title="YouTube video player"
                                            frameborder="0"
                                            allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture"
                                            allowfullscreen="allowfullscreen"></iframe> <span>сегодня</span>
                                        <p>Сегодня «Фармтек» — это 15 лет стремительного роста и уникального опыта,
                                            представители в 56 городах страны и 53 высокоэффективных препаратов,
                                            заслуживших доверие специалистов и любовь покупателей. Продукцию «Фармтек»
                                            можно найти в 70 000 аптек по всей России.</p>
                                        <p>Строгий научный подход к разработке продукции, концентрация усилий в одном
                                            терапевтическом направлении и большой практический опыт менеджмента,
                                            обеспечивает уверенное развитие «Фармтек» в области дерматологии. Все
                                            средства производятся с соблюдением международных стандартов качества.
                                            Препараты проходят клинические испытания на базе ведущих российских
                                            научно-клинических учреждений и обладают доказанной эффективностью.</p>
                                    </div>
                                </div>
                                <div class="our-mission">
                                    <div class="us-mission">
                                        <p>Наша миссия — создавать новые, эффективные, доступные решения для здоровья и
                                            красоты.</p>
                                        <blockquote>В идеальных условиях кожа — источник защиты и красоты. Но в
                                            реальности нередки состояния, когда коже самой требуется помощь и защита. Мы
                                            стремимся не только справиться с проблемой, но прежде всего - услышать
                                            человека, который с этой проблемой живет. Понять, что ему необходимо.
                                        </blockquote>
                                    </div>
                                    <div class="we-want">
                                        <p>Мы хотим предложить по-настоящему новые и более эффективные решения, чтобы:
                                        </p>
                                        <ul>
                                            <li>нормализовать состояния кожи, волос и ногтей</li>
                                            <li>усилить эффективность назначенной терапии</li>
                                            <li>уменьшить потребность в лекарственных препаратах</li>
                                            <li>продлить период ремиссии при хронических проблемах</li>
                                            <li>решить проблемы социальной адаптации</li>
                                        </ul>
                                    </div>
                                </div>
                                <div class="we-strive">
                                    <p>Мы стремимся создать <span>лучшие средства</span> для красоты и здоровья.</p>
                                    <span>Мы хотим, чтобы эти средства были доступны, когда потребуется помощь. Мы
                                        работаем, чтобы качество жизни становилось выше. День за днем. </span>
                                </div>
                                <div class="our-expertise-wrapper">
                                    <p class="our-expertise-title">Наша экспертиза</p>
                                    <div class="our-expertiseleft">
                                        <blockquote>Усилия специалистов «Фармтек» сконцентрированы в области
                                            дерматологии и позволяют в значительной мере покрыть данный сегмент рынка.
                                            Компоненты препаратов «Фармтек» входят в Федеральные клинические
                                            рекомендации и стандарты лечения заболеваний кожи.</blockquote>
                                        <div>
                                            <p><b>Мы разработаем с самыми распространенными проблемами, требующими
                                                    длительного и сложного лечения.</b> Это основные причины обращения к
                                                врачу-дерматологу:</p>
                                            <ul>
                                                <li>- Грибковые инфекции стопы (серия <b>«Микостоп»</b>)</li>
                                                <li>- Острые, подострые и хронические дерматиты (эмоллиенты
                                                    <b>«Липобейз»</b> и <b>«Скин-Актив»</b>, крем и гель для душа
                                                    <b>«Циновит»</b>).</li>
                                            </ul>
                                        </div>
                                        <div>
                                            <p><b>Мы сосредоточены не только на дерматологических, но и на
                                                    психосоциальных проблемах,</b> которые становятся источником стресса
                                                и затрудненной социальной адаптации:</p>
                                            <ul>
                                                <li>- Гипергидроз, повышенная потливость (серия антиперспирантов
                                                    длительного действия <b>«Алгель»</b></li>
                                                <li>- Акне: прыщи, угри, черные точки (спрей и крем-гель
                                                    <b>«Циновит»</b>)</li>
                                                <li>- Бородавки (крем-паста <b>«Вартокс»</b>)</li>
                                            </ul>
                                        </div>
                                    </div>
                                    <div class="our-expertise-right">
                                        <div>
                                            <p><b>Мы первыми на российском рынке предложили эффективные, удобные и
                                                    современные формы</b> в нишах, где у врачей не было средств для
                                                решения определенных задач. Препараты удовлетворили потребности
                                                аудитории и стали незаменимыми в арсенале практикующего дерматолога:</p>
                                            <ul>
                                                <li>- Противогрибковая обработка обуви и профилактика повторно заражения
                                                    (спрей <b>«Микостоп»</b>)</li>
                                                <li>- Быстрое устранение подошвенного гиперкератоза, мозолей и
                                                    натоптышей в т.ч. при сахарном диабете (раствор <b>«Аквапилинг»</b>)
                                                </li>
                                                <li>- Решение проблемы ониходистрофии — истонченных, ломких,
                                                    поврежденных ногтей (лосьоны <b>«Клавио»</b> на водной основе с
                                                    хитозаном).</li>
                                            </ul>
                                        </div>
                                        <div>
                                            <p><b>Эффективность компонентов и препаратов «Фармтек» подтверждена в
                                                    результате исследований на базе ведущих клинических институтов РФ, в
                                                    том числе:</b></p>
                                            <ul>
                                                <li>- НИИ медицинской микологии им. П.Н.Кашкина</li>
                                                <li>- Первый Санкт-Петербургский государственный медицинский университет
                                                    им. акад. И.П. Павлова</li>
                                                <li>- Санкт-Петербургский государственный педиатрический медицинский
                                                    университет&nbsp;</li>
                                                <li>- Нижегородская государственная медицинская академия</li>
                                            </ul>
                                        </div>
                                    </div>
                                </div>
                                <div class="our-principle">
                                    <p>Наши принципы</p>
                                    <div><img src="./assets/flasks.svg" alt="">
                                        <p>Разработка препаратов «Фармтек» проводится в тесном сотрудничестве с
                                            <b>ведущими специалистами</b> в области дерматологии, а также с
                                            практикующими врачами-дерматологами</p>
                                    </div>
                                    <div><img src="./assets/magnifying-glass.svg" alt="">
                                        <p>Все составы препаратов «Фармтек» являются оригинальными. Каждая формула —
                                            результат <b>тщательного изучения потребностей</b> специалистов и пациентов
                                        </p>
                                    </div>
                                    <div><img src="./assets/eco.svg" alt="">
                                        <p>Максимальное предпочтение в составах отдается <b>натуральным и родственным
                                                коже компонентам</b> с высоким профилем безопасности. Средства не
                                            содержат парабенов, фталатов, спирта и минеральных масел.</p>
                                    </div>
                                    <div><img src="./assets/shield.svg" alt="">
                                        <p>Огромное значение придается <b>гипоаллергенности</b> и комфортности формул,
                                            чтобы средства «Фармтек» подходили широкому кругу пациентов, включая детей с
                                            рождения.</p>
                                    </div>
                                    <div><img src="./assets/rabbit.svg" alt="">
                                        <p>Продукция «Фармтек» <b>не тестируется на животных.</b></p>
                                    </div>
                                </div>
                                <div class="our-partner">
                                    <p class="our-partner-title">Наши партнеры</p>
                                    <div class="row">

                                        <div >
                                            <p>Производство</p>
                                            <span>Препараты производятся на мощностях современного высокотехнологичного
                                                завода ЗАО «Зеленая дубрава»</span>
                                        </div>
                                        <div>
                                            <p>Дистрибуция</p>
                                            <span>Главные дистрибьюторы страны «Протек», «Катрен» и др.</span>
                                        </div>
                                        <div>
                                            <p>Розница</p>
                                            <span>Препараты «Фармтек» представлены в 70&nbsp;000 аптек по всей России,
                                                включая ключевые аптечные сети: «ЭркаФарм», «Ригла», «АСНА», «Планета
                                                Здоровья», «НеоФарм» и др. </span>
                                        </div>
                                    </div>
                                    <div class="row">
                                        <div>
                                            <p class="part_title">Эксперты</p>
                                            <span>Ведущие специалисты в области дерматологии: </span>
                                            <ul>
                                                <li>Денис Владимирович Заславский д.м.н., профессор кафедры
                                                    дерматовенерологии Санкт-Петербургского государственного
                                                    педиатрического медицинского университета</li>
                                                <li>Константин Николаевич Монахов, д. м. н., профессор кафедры
                                                    дерматовенерологии Санкт-Петербургского государственного
                                                    медицинского университета имени акад. И.П. Павлова</li>
                                                <li>Ольга Борисовна Тамразова, д.м.н., профессор кафедры
                                                    дерматовенерологии РУДН, специалист детской дерматологии</li>
                                                <li>Ирена Леонидовна Шливко д. м. н., профессор кафедры
                                                    дерматовенерологии ФГБОУ ВО НижГМА</li>
                                                <li>Ирина Евгеньевна Торшина, д. м. н., заведующая кафедрой кожных и
                                                    венерических болезней СГМА</li>
                                            </ul>
                                        </div>
                                        <div>
                                            <p class="part_title">Профессиональные медицинские ассоциации:</p>
                                            <ul>
                                                <li>Общероссийская общественная организация «Российское общество
                                                    дерматовенерологов и косметологов»</li>
                                                <li>Межрегиональное общественное объединение «Союз педиатров России»
                                                </li>
                                                <li>Общероссийская общественная организация «Ассоциация детских
                                                    аллергологов и иммунологов России» (АДАИР)</li>
                                                <li>Социально-образовательная программа в области материнства и
                                                    детства&nbsp;«Университет материнства»</li>
                                                <li>Общероссийская общественная научная организация «Национальная
                                                    академия микологии»</li>
                                            </ul>
                                        </div>
                                    </div>
                                </div>
                                <div class="price-policy">
                                    <p>Наша ценовая политика</p>
                                    <span><b>Наша задача — помочь как можно большему количеству людей, поэтому наша
                                            продукция максимально доступна.</b> Мы строго подходим к вопросу комфортной
                                        стоимости, но никогда не идем на компромиссы в вопросах качества. Мы не
                                        используем нецелесообразно дорогую упаковку и навязчивые рекламные кампании.
                                        Приобретая продукцию «Фармтек», покупатель не переплачивает за услуги, в которых
                                        не нуждается. </span> <a class="btn" href="/brands/">смотреть каталог</a>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>

    </div>
</template>

<style scoped>
@import './style/style-about_company.scss';
</style>
<script>
import navbar from '../../components/navbar/navbar.vue';
export default {
    components: { navbar },
    setup() {

    },
}
</script>